

var lessons = [
	{
		title: 'שיעור ראשון - הכר את הצב',
		steps : [
		{
			title : "הצב של לוגו",
			explanation : "שלום, אני תוכנת לוגו. הצב שלי הוא החץ המופיע במרכז המסך. פקודות לוגו מאפשרות שליטה בצב. הפקודה הראשונה שנלמד תזיז את הצב קדימה, פקודה זו נקראית בפשטות קדימה ולאחריה מספר. המספר מציין את אורך ההתקדמות.",
			action : "רשום את הפקודה קדימה 50",
			solution : "קד 50",
			hint : ""
		},
		{
			title : "הצב יודע לפנות",
			explanation : "הצב יודע גם לפנות. פקודות הפנייה הן שמאלה או ימינה ולאחריהן מספר. אנו מציינים עבור הצב את מעלות הפנייה כאשר סיבוב מלא הוא 360 מעלות. זווית ישרה היא זווית של 90 מעלות כך שפנייה ישרה שמאלהה תבוצע באמצעות הפקודה שמאלה 90.",
			action : "גרום לצב לפנות פנייה ישרה ימינה",
			solution : "ימ 90",
			hint : "אנו רוצים לפנות ימינה בזווית ישרה"
		},
		{
			title : "סיבוב אחורה",
			explanation : "סיבוב אחורה הוא סיבוב של 180 מעלות ואין כאן הבדל בין שמאלה לימינה.",
			action : "פנה אחורה באמצעות הפקודה שמאלה",
			solution : "שמ 180",
			hint : ""
		},	
		{
			title : "האות ר",
			explanation : "האות ר פשוטה מאוד לכתיבה וכפי שניתן לראות, אם נזיז את הצב עוד קדימה נשלים את ציור האות",
			action : "השלם את האות ר",
			solution : "קד 50",
			hint : "הצלע הראשונה של האות ר הייתה באורך 50"
		},	
		{
			title : "ניקוי המסך",
			explanation : "כאשר אנו רוצים להתחיל ציור חדש, אנו אנו מנקים את המסך באמצעות הפקודה נקהמסך.",
			action : "נקה את המסך",
			solution : "נמ",
			hint : ""
		},
		{
			title : "חיבור פקודות",
			explanation : "בלוגו ניתן לכתוב כמה פקודות האחת אחרי השנייה ויש להשתמש ברווח בין הפקודות. למשל: ימינה 90 קדימה 50.",
			action : "צייר את האות ר באורך 50, בשורה אחת בלבד הכוללת 3 פקודות",
			solution : "קד 50 שמ 90 קד 50",
			hint : "כדי לצייר את האות ר מספיק להתקדם, לפנות פנייה ישרה שמאלה, ולהתקדם שוב"
		},
		{
			title : "קיצורים",
			explanation : ".ניתן לקצר את הפקודות בהן השתמשנו כבר. במקום ימינה מספיק לכתוב ימ. במקום שמאלה מספיק לכתוב שמ. במקום קדימה קד ובמקום נקהמסך מספיק לכתוב נמ. כעת נראה שניתן לחזור על ציור האות ר בקלות בשורת פקודה יחידה",
			action : "צייר עוד פעם את האות ר באורך 50, בשורה אחת בלבד הכוללת 3 פקודות מקוצרות",
			solution : "קד 50 שמ 90 קד 50",
			hint : "הפתרון דומה לפתרון הקודם אך הפעם אנו משתמשים בגרסה המקוצרת של כל פקודה"
		}
		]
	},
	{
		title: 'שליטה בצב ובעט',
		steps : [
		{
			title : "מהו העט?",
			explanation : "ניתן לדמיין שהצב של לוגו, אותו הכרנו בשיעור הקודם, מחזיק בידו עט תוך כדי הליכה. בעט הוא משתמש כדי לצייר כאשר אנו נותנים לו הוראות כמו התקדמות קדימה.",
			action : "בקש מן הצב להתקדם קדימה 30 נקודות וראה את הקו שהוא מצייר",
			solution : "קד 30",
			hint : "כדאי להשתמש בגרסה המקוצרת של הפקודה קדימה"
		},
		{
			title : "הרמת העט",
			explanation : "ניתן לבקש מן הצב להרים את העט כך שכשילך, לא יצוייר שום דבר חדש. הפקודה להרמת העט היא הרםעט.",
			action : "בקש מן הצב להרים את העט",
			solution : "הרםעט",
			hint : ""
		},
		{
			title : "התקדמות ללא העט",
			explanation : "כאשר העט מורם, לא יצוייר שום דבר חדש.",
			action : "בקש מן הצב להקדם עוד 40 נקודות",
			solution : "קד 40",
			hint : ""
		},
		{
			title : "הורדת העט",
			explanation : "ראינו שהצב התקדם ללא ציור של קו נוסף. כדי להמשיך לצייר נבקש מהצב להוריד שוב את העט באמצעות פקודת הורדעט.",
			action : "בקש מן הצב להוריד את העט",
			solution : "הורדעט",
			hint : ""
		},
		{
			title : "התקדמות נוספת עם העט",
			explanation : "כעת חזרנו למצב הקודם ונוודא שהעט אכן מוכן לפעולה.",
			action : "בקש מן הצב להקדם עוד 40 נקודות",
			solution : "קד 40",
			hint : ""
		},
		{
			title : "החבאת הצב",
			explanation : "לעיתים נבקש מהצב להתחבא כדי שנוכל לראות את הציור שלנו ללא הצב. הפקודה היא החבאצב",
			action : "בקש מן הצב להתחבא",
			solution : "החבאצב",
			hint : ""
		},
		{
			title : "ציור עם צב חבוי",
			explanation : "גם הצב החבוי יודע לצייר ובעצם הוא מוצג על המסך רק לנוחותנו.",
			action : "בקש מן הצב לפנות בזווית ישרה שמאלה ולהתקדם עוד 40 נקודות",
			solution : "שמ 90 קד 40",
			hint : "זווית ישרה היא זווית של 90 מעלות"
		},
		{
			title : "הצגת הצב מחדש",
			explanation : "אפילו שנוכל תמיד לעבוד בלי לראות את הצב, נוח לעיתים לראות אותו ולכן נוכל לבקש להציג את הצב מחדש באמצעות פקודת הצגצב.",
			action : "גרום לצב להיות מוצג שוב",
			solution : "הצגצב",
			hint : ""
		}
		]
	},
	{
		title: 'רשימות ולולאות',
		steps : [
		{
			title : "ציור ריבוע",
			explanation : "בואו ונצייר ריבוע באורך 50 נקודות באמצעות פקודות מקוצרות. את הריבוע נצייר באמצעות התקדמות ואז פנייה בזווית ישרה שמאלה.",
			action : "צייר ריבוע באמצעות רצף הוראות לוגו המופרד ברווח",
			solution : "קד 50 שמ 90 קד 50 שמ 90 קד 50 שמ 90 קד 50 שמ 90 ",
			hint : "ריבוע הוא מרובע בעל ארבע צלעות שוות אורך. הזווית בין כל שתי צלעות סמוכות בריבוע ישרה. " +
					"שים לב שיש שתי פקודות, קד ואחריה שמ, עליהן אנו חוזרים ארבע פעמים."
		},
		{
			title : "ריבוע עם לולאה",
			explanation : "אנו רואים כי לא נוח לחזור שוב ושוב על אותן הפקודות ולצורך כך תוכנת לוגו מאפשרת לנו לחזור על רשימת פקודות באמצעות סוגריים מרובעים." +
					" את ציור הריבוע הקודם נוכל לכתוב בצורה פשוטה הרבה יותר כך: חזור 4 [קד 50 שמ 90]." +
					" המספר אחרי פקודת חזור אומר כמה פעמים לחזור על רשימת הפקודות." +
					" את פקודת החזור וכל רשימת הפקודות עליהן אנו חוזרים, נכנה בשם לולאה.",
			action : "צייר ריבוע נוסף באורך 100 נקודות אך הפעם השתמש בלולאה",
			solution : "חזור 4 [קד 100 שמ 90]",
			hint : ""
		},
		{
			title : "מתומן עם לולאה",
			explanation : "כפי שמרובע הוא מצולע בעל ארבע צלעות, מתומן הוא מצולע בעל שמונה צלעות. " +
					"כפי שריבוע הוא מרובע שכל צלעותיו שוות באורכן, מתומן משוכלל הוא מתומן שכל צלעותיו שוות באורכן. " +
					"כאשר אנו אומרים לצב של לוגו לפנות, הזווית במתומן תהיה חצי מאורך הזווית בריבוע",
			action : "צייר מתומן שאורך כל צלע שלו 70 נקודות",
			solution : "חזור 8 [קד 70 שמ 45]",
			hint : "בדומה לריבוע, אנו חוזרים על הפקודות, אך יותר פעמים ובזווית של 45 מעלות"
		},
		{
			title : "לולאות מקוננות",
			explanation : "כל פעולה יכולה להתבצע בתוך לולאה. ניתן לכתוב לולאה בתוך לולאה אחרת. " +
					"לולאה המתבצעת בתוך לולאה אחרת נקראית לולאה מקוננת. " +
					"המילה קינון היא אותה המילה כמו בקן של ציפור. אנחנו לא יודעים למה משתמשים בה בתכנות.",
			action : "לפני שנמשיך, נקה בבקשה את המסך",
			solution : "נקהמסך",
			hint : "פקודת ניקוי מסך הופיעה בשיעור קודם"
		},
		{
			title : "ארבעה ריבועים",
			explanation : "המבנה של לולאות מקוננות זהה לזה של הלולאות בהן השתמשנו. " +
					"כך שניתן לרשום למשל חזור 7 [הרםעט קד 10 הורדעט חזור 4 [קד 5 ימ 90]]. ",
			action : "צייר 9 ריבועים בטור אחד. אורך צלע בכל ריבוע תהיה 5 נקודות והרווח בין הריבועים יהיה באורך 8 נקודות.",
			solution : "חזור 9 [הרםעט קד 8 הורדעט חזור 4 [קד 5 ימ 90]]",
			hint : "הדוגמא שנתנו מעלה ללולאה מקוננת די דומה לפתרון"
		},
		{
			title : "קדימה ואחורה",
			explanation : "הפקודה אחורה דומה לפקודה קדימה והקיצור שלה הוא אח",
			action : "בשורה אחת, עם פקודות מקוצרות, נקה את המסך, צייר קו באורך 100 נקודות והחזר את הצב להתחלה",
			solution : "נמ קד 100 אח 100",
			hint : ""
		},
		{
			title : "כוכבית",
			explanation : "אנו רואים שהצב חזר למקומו וכעת אנו רוצים לצייר כוכבית באמצעות לולאה ופקודות אחורה. " +
					"במעגל 360 מעלות כך שאם נרצה כוכבית העשויה מ-20 קווים, נפנה כל פעם ב- 360/20=18 מעלות.",
			action : "צייר כוכבית מ-20 קווים שאורך כל אחד 80 נקודות",
			solution : "חזור 20 [קד 80 אח 80 ימ 18]",
			hint : ""
		},
		{
			title : "מתומנים משוגעים",
			explanation : "עם לולאות אנחנו יכולים לצייר צורות סימטריות משוגעות בקלות רבה מאוד. " +
					"הפעם נצייר 36 מתומנים במעגל באמצעות לולאה כפולה. " +
					"הזווית בה נצטרך לפנות תהיה 360/36=10 מעלות",
			action : "נקה מסך וצייר באמצעות שתי לולאות 36 מתומנים משוכללים כאשר אורך צלע בכל מתומן 50 נקודות",
			solution : "נמ חזור 36 [ימ 10 חזור 8 [קד 50 שמ 45]]",
			hint : "למעלה ראינו כיצד לצייר מתומן עם לולאה יחידה וכן כיצד להשתמש בלולאה מקוננת. לא לשכוח לנקות מסך בתחילת הפקודה כדי לראות את הצורה היפה."
		}
		]
	},
	{
		title: 'רוחב וצבעי העט',
		steps : [
		{
			title : "רוחב העט",
			explanation : "עד עכשיו ציירנו רק עם עט ברוחב של נקודה אחת ובצבע שחור." +
					" כדי לצייר ציורים יפים יותר נרצה לעיתים לשנות את רוחב העט ואת צבעו. " +
					"כדי לשנות את רוחב העט נשתמש בפקודה שנהרוחב ולאחריה מספר המייצג את רוחב העט החדש בנקודות.",
			action : "קבע את רוחב העט ל-5 נקודות",
			solution : "שנהרוחב 5",
			hint : ""
		},
		{
			title : "קו רחב יותר",
			explanation : "כדי לראות את הקו הרחב יותר נצייר משהו",
			action : "צייר קו באורך 50 נקודות",
			solution : "קד 50",
			hint : ""
		},
		{
			title : "רחב יותר",
			explanation : "בוא נשחק עוד מעט עם רוחב העט. ",
			action : "קבע רוחב עט כפול מהקודם וצייר קו באורך 60 נקודות",
			solution : "שנהרוחב 10 קד 60",
			hint : "חמש כפול שתיים"
		},
		{
			title : "",
			explanation : "",
			action : "",
			solution : "",
			hint : ""
		},
		{
			title : "",
			explanation : "",
			action : "",
			solution : "",
			hint : ""
		},
		{
			title : "",
			explanation : "",
			action : "",
			solution : "",
			hint : ""
		},
		{
			title : "",
			explanation : "",
			action : "",
			solution : "",
			hint : ""
		},
		{
			title : "",
			explanation : "",
			action : "",
			solution : "",
			hint : ""
		}
		]
	},
	{
		title: '',
		steps : [
		{
			title : "",
			explanation : "",
			action : "",
			solution : "",
			hint : ""
		},
		{
			title : "",
			explanation : "",
			action : "",
			solution : "",
			hint : ""
		}
		]
	}
];

